import tkinter as tk
import random

#プログラムで使う設定値を定義する（はじまり）/////////////////////////////////////////////////////

dice_im =['d01.gif', 'd02.gif', 'd03.gif', 'd04.gif', 'd05.gif', 'd06.gif']

#プログラムで使う設定値を定義（おわり）//////////////////////////////////////////////////////////

#プログラムで使う関数を定義（はじまり）///////////////////////////////////////////////////////////
#サイコロを表示する関数
def load_dice():
    global im
    canvas.delete('all')
    i = random.randint(1,6)
    im = tk.PhotoImage(file=dice_im[i-1])
    canvas.create_image(150, 150, image=im)

#プログラムで使う関数を定義（おわり）////////////////////////////////////////////////////////////


#プログラム本文（はじまり）/////////////////////////////////////////////////////////////////////

mform = tk.Tk()
canvas = tk.Canvas(mform, width=300, height=300)
canvas.pack()

#ボタンの設定
btn1 = tk.Button(mform, text='サイコロをふる', font=('', '12'), command=load_dice)
btn1.pack()

mform.mainloop()

#プログラム本文（おわり）/////////////////////////////////////////////////////////////////////
